[
  {
    "arabic": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
    "english": "Our Lord, give us in this world good and in the Hereafter good, and protect us from the punishment of the Fire.",
    "reference": "2:201",
    "surah": "Al-Baqarah",
    "tags": ["good", "hereafter", "protection", "fire", "comprehensive", "goals"],
    "context": "The most recited du'a in the Quran. Asks for the best of both worlds—success, health, happiness, and provision in this life, and Paradise in the next."
  },
  {
    "arabic": "رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا",
    "english": "Our Lord, do not impose blame upon us if we forget or make a mistake.",
    "reference": "2:286",
    "surah": "Al-Baqarah",
    "tags": ["forgiveness", "mistakes", "mercy", "problem"],
    "context": "Du'a for forgiveness of unintentional errors and forgetfulness. For someone who made a mistake or forgot an obligation."
  },
  {
    "arabic": "رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً إِنَّكَ أَنتَ الْوَهَّابُ",
    "english": "Our Lord, let not our hearts deviate after You have guided us and grant us from Yourself mercy. Indeed, You are the Bestower.",
    "reference": "3:8",
    "surah": "Aal-Imran",
    "tags": ["heart", "guidance", "mercy", "steadfastness", "faith", "doubt"],
    "context": "Du'a for staying firm on the straight path and not going astray. For someone experiencing doubt, wavering faith, or fear of deviation."
  },
  {
    "arabic": "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِن ذُرِّيَّتِي رَبَّنَا وَتَقَبَّلْ دُعَاءِ",
    "english": "My Lord, make me an establisher of prayer, and from my descendants. Our Lord, and accept my supplication.",
    "reference": "14:40",
    "surah": "Ibrahim",
    "tags": ["prayer", "children", "family", "descendants", "worship", "parenting"],
    "context": "Du'a of Prophet Ibrahim for himself and his children to be consistent in prayer. For parents wanting righteous children who pray."
  },
  {
    "arabic": "رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ",
    "english": "My Lord, enable me to be grateful for Your favor which You have bestowed upon me and upon my parents, and to do righteousness of which You approve.",
    "reference": "27:19",
    "surah": "An-Naml",
    "tags": ["gratitude", "parents", "righteousness", "blessings", "goals"],
    "context": "Du'a of Prophet Sulayman for gratitude toward Allah's blessings on him and his parents, and for righteous deeds. For honoring parents and being thankful."
  },
  {
    "arabic": "رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
    "english": "Our Lord, forgive us our sins and the excess in our affairs and plant firmly our feet and give us victory.",
    "reference": "3:147",
    "surah": "Aal-Imran",
    "tags": ["forgiveness", "sins", "steadfastness", "victory", "strength", "patience"],
    "context": "Du'a for forgiveness, firmness, and victory. For someone facing opposition, needing strength and steadfastness in their struggle."
  },
  {
    "arabic": "رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي",
    "english": "My Lord, indeed I have wronged myself, so forgive me.",
    "reference": "28:16",
    "surah": "Al-Qasas",
    "tags": ["forgiveness", "sins", "repentance", "self", "problem", "guilt"],
    "context": "Du'a of Prophet Musa after realizing he wronged himself. For someone burdened by guilt and seeking sincere repentance."
  },
  {
    "arabic": "لَّا إِلَٰهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ",
    "english": "There is no deity except You; exalted are You. Indeed, I have been of the wrongdoers.",
    "reference": "21:87",
    "surah": "Al-Anbiya",
    "tags": ["distress", "difficulty", "relief", "repentance", "problem", "crisis", "trapped", "hopeless"],
    "context": "Du'a of Prophet Yunus from the belly of the whale. The most powerful du'a for extreme distress, crisis, feeling trapped, or when all doors seem closed."
  },
  {
    "arabic": "رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي",
    "english": "My Lord, expand for me my chest and ease for me my task.",
    "reference": "20:25-26",
    "surah": "Ta-Ha",
    "tags": ["ease", "difficulty", "confidence", "task", "work", "problem", "goals", "anxiety", "presentation"],
    "context": "Du'a of Prophet Musa before a daunting task. For someone facing a difficult assignment, job interview, presentation, or any challenging situation needing confidence and ease."
  },
  {
    "arabic": "رَبِّ زِدْنِي عِلْمًا",
    "english": "My Lord, increase me in knowledge.",
    "reference": "20:114",
    "surah": "Ta-Ha",
    "tags": ["knowledge", "learning", "wisdom", "education", "goals", "study", "exams"],
    "context": "The Quran's direct command to ask for more knowledge. For students, scholars, and anyone on a learning journey."
  },
  {
    "arabic": "حَسْبِيَ اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
    "english": "Sufficient for me is Allah; there is no deity except Him. On Him I have relied, and He is the Lord of the Great Throne.",
    "reference": "9:129",
    "surah": "At-Tawbah",
    "tags": ["reliance", "trust", "sufficiency", "tawakkul", "problem", "worry", "fear"],
    "context": "Declaration of complete reliance on Allah. For someone who is worried, anxious, or feeling unsupported—trusting that Allah alone is enough."
  },
  {
    "arabic": "رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا",
    "english": "Our Lord, grant us from among our spouses and offspring comfort to our eyes and make us an example for the righteous.",
    "reference": "25:74",
    "surah": "Al-Furqan",
    "tags": ["family", "spouse", "children", "marriage", "righteousness", "goals", "love", "happiness", "partner"],
    "context": "The primary Quranic du'a for marriage and family. Asking for a loving spouse, righteous children, and being a role model. For someone seeking marriage, wanting family happiness, or praying for their spouse and kids."
  },
  {
    "arabic": "رَبِّ هَبْ لِي مِن لَّدُنكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاءِ",
    "english": "My Lord, grant me from Yourself a good offspring. Indeed, You are the Hearer of supplication.",
    "reference": "3:38",
    "surah": "Aal-Imran",
    "tags": ["children", "offspring", "family", "prayer", "goals", "fertility", "parenthood"],
    "context": "Du'a of Prophet Zakariyya asking for a child. For someone longing for children, struggling with fertility, or wanting righteous offspring."
  },
  {
    "arabic": "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا",
    "english": "Our Lord, pour upon us patience and plant firmly our feet.",
    "reference": "2:250",
    "surah": "Al-Baqarah",
    "tags": ["patience", "steadfastness", "strength", "trials", "problem", "sabr", "hardship", "endurance", "perseverance"],
    "context": "Powerful Quranic du'a specifically for patience (sabr) and steadfastness during trials. For someone going through hardship, needing endurance, or facing a difficult prolonged situation."
  },
  {
    "arabic": "رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
    "english": "Our Lord, we have wronged ourselves, and if You do not forgive us and have mercy upon us, we will surely be among the losers.",
    "reference": "7:23",
    "surah": "Al-A'raf",
    "tags": ["forgiveness", "mercy", "repentance", "sins", "problem", "guilt", "regret"],
    "context": "Du'a of Adam and Hawa after their mistake in Paradise. For someone deeply remorseful, acknowledging their wrongs, and desperately seeking Allah's mercy."
  },
  {
    "arabic": "رَبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ وَأَعُوذُ بِكَ رَبِّ أَن يَحْضُرُونِ",
    "english": "My Lord, I seek refuge in You from the incitements of the devils, and I seek refuge in You, my Lord, lest they be present with me.",
    "reference": "23:97-98",
    "surah": "Al-Mu'minun",
    "tags": ["protection", "evil", "shaytan", "safety", "whispers", "temptation"],
    "context": "Du'a for protection from Shaytan's whispers and influence. For someone dealing with evil thoughts, waswas, temptation, or negative spiritual influences."
  },
  {
    "arabic": "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ",
    "english": "Our Lord, forgive me and my parents and the believers the Day the account is established.",
    "reference": "14:41",
    "surah": "Ibrahim",
    "tags": ["forgiveness", "parents", "believers", "hereafter", "judgment", "family"],
    "context": "Du'a of Prophet Ibrahim for himself, his parents, and all believers. For someone wanting to pray for their parents' forgiveness and the entire ummah."
  },
  {
    "arabic": "رَبِّ إِنِّي لِمَا أَنزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ",
    "english": "My Lord, indeed I am, for whatever good You would send down to me, in need.",
    "reference": "28:24",
    "surah": "Al-Qasas",
    "tags": ["need", "provision", "good", "humility", "goals", "problem", "poverty", "job", "rizq", "marriage"],
    "context": "Du'a of Prophet Musa when he was alone, had nothing, and needed help. For someone in need—financially, emotionally, or seeking marriage, a job, or any form of provision. Expressing complete dependence on Allah."
  },
  {
    "arabic": "رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ",
    "english": "Our Lord, accept from us. Indeed You are the Hearing, the Knowing.",
    "reference": "2:127",
    "surah": "Al-Baqarah",
    "tags": ["acceptance", "prayer", "worship", "hearing", "deeds"],
    "context": "Du'a of Prophet Ibrahim and Ismail while building the Ka'bah. For acceptance of one's good deeds, worship, and prayers."
  },
  {
    "arabic": "رَبَّنَا آتِنَا مِن لَّدُنكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا",
    "english": "Our Lord, grant us from Yourself mercy and prepare for us from our affair right guidance.",
    "reference": "18:10",
    "surah": "Al-Kahf",
    "tags": ["mercy", "guidance", "affairs", "help", "goals", "direction", "decisions"],
    "context": "Du'a of the youth of the cave (Ashaab al-Kahf) seeking mercy and guidance in a difficult situation. For someone needing divine direction and mercy in their affairs."
  },
  {
    "arabic": "رَبِّ نَجِّنِي وَأَهْلِي مِمَّا يَعْمَلُونَ",
    "english": "My Lord, save me and my family from what they do.",
    "reference": "26:169",
    "surah": "Ash-Shu'ara",
    "tags": ["protection", "family", "safety", "harm", "problem", "environment", "corruption"],
    "context": "Du'a of Prophet Lut for protection of his family from a corrupt environment. For someone in a harmful situation wanting safety for themselves and their family."
  },
  {
    "arabic": "رَبِّ أَنزِلْنِي مُنزَلًا مُّبَارَكًا وَأَنتَ خَيْرُ الْمُنزِلِينَ",
    "english": "My Lord, let me land at a blessed landing place, and You are the best to accommodate.",
    "reference": "23:29",
    "surah": "Al-Mu'minun",
    "tags": ["travel", "home", "blessings", "accommodation", "moving", "new place", "relocation"],
    "context": "Du'a for a blessed destination. For someone moving, traveling, relocating, finding a new home, or starting fresh in a new place."
  },
  {
    "arabic": "رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ الظَّالِمِينَ وَنَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكَافِرِينَ",
    "english": "Our Lord, make us not a trial for the wrongdoing people and save us by Your mercy from the disbelieving people.",
    "reference": "10:85-86",
    "surah": "Yunus",
    "tags": ["protection", "oppression", "mercy", "safety", "problem", "injustice"],
    "context": "Du'a for protection from oppression and injustice. For someone facing persecution, unfair treatment, or living under oppressive conditions."
  },
  {
    "arabic": "رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا إِنَّكَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
    "english": "Our Lord, perfect for us our light and forgive us. Indeed, You are over all things competent.",
    "reference": "66:8",
    "surah": "At-Tahrim",
    "tags": ["light", "forgiveness", "guidance", "power", "clarity"],
    "context": "Du'a for perfecting one's spiritual light and gaining forgiveness. For someone seeking clarity, spiritual illumination, and divine pardon."
  },
  {
    "arabic": "رَبِّ هَبْ لِي حُكْمًا وَأَلْحِقْنِي بِالصَّالِحِينَ",
    "english": "My Lord, grant me authority and join me with the righteous.",
    "reference": "26:83",
    "surah": "Ash-Shu'ara",
    "tags": ["authority", "righteousness", "wisdom", "goals", "leadership", "success"],
    "context": "Du'a of Prophet Ibrahim for wisdom, authority, and to be among the righteous. For someone aspiring to leadership, success, and wanting to be counted among the pious."
  },
  {
    "arabic": "وَقُل رَّبِّ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا",
    "english": "My Lord, have mercy upon my parents as they brought me up when I was small.",
    "reference": "17:24",
    "surah": "Al-Isra",
    "tags": ["parents", "mercy", "family", "gratitude", "mother", "father", "elderly"],
    "context": "The primary Quranic du'a for parents. For honoring and praying for one's mother and father, especially as they age."
  },
  {
    "arabic": "رَبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ وَاجْعَل لِّي مِن لَّدُنكَ سُلْطَانًا نَّصِيرًا",
    "english": "My Lord, cause me to enter a sound entrance and to exit a sound exit and grant me from Yourself a supporting authority.",
    "reference": "17:80",
    "surah": "Al-Isra",
    "tags": ["entrance", "exit", "authority", "support", "goals", "travel", "transitions", "new beginning"],
    "context": "Du'a for blessed transitions—entering and leaving any situation, place, or phase of life. For new beginnings, job changes, moving, or any life transition."
  },
  {
    "arabic": "إِنَّ مَعَ الْعُسْرِ يُسْرًا",
    "english": "Indeed, with hardship comes ease.",
    "reference": "94:6",
    "surah": "Ash-Sharh",
    "tags": ["ease", "hardship", "hope", "patience", "problem", "sabr", "relief", "perseverance"],
    "context": "Allah's direct promise that ease accompanies every hardship. For someone in the middle of difficulty who needs hope, patience, and reassurance that relief is coming."
  },
  {
    "arabic": "وَلَسَوْفَ يُعْطِيكَ رَبُّكَ فَتَرْضَىٰ",
    "english": "And your Lord is going to give you, and you will be satisfied.",
    "reference": "93:5",
    "surah": "Ad-Duha",
    "tags": ["hope", "provision", "satisfaction", "goals", "future", "patience", "waiting", "promise"],
    "context": "Allah's promise of eventual satisfaction and fulfillment. For someone waiting for something, feeling impatient, or needing reassurance that Allah's gifts are coming."
  },
  {
    "arabic": "فَإِنَّ مَعَ الْعُسْرِ يُسْرًا",
    "english": "For indeed, with hardship will be ease.",
    "reference": "94:5",
    "surah": "Ash-Sharh",
    "tags": ["hardship", "ease", "relief", "hope", "patience", "sabr", "trials"],
    "context": "Allah's repeated assurance that ease is inseparable from hardship. For patience during prolonged difficulty."
  },
  {
    "arabic": "وَمَن يَتَّقِ اللَّهَ يَجْعَل لَّهُ مَخْرَجًا وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ",
    "english": "And whoever fears Allah—He will make for him a way out and will provide for him from where he does not expect.",
    "reference": "65:2-3",
    "surah": "At-Talaq",
    "tags": ["taqwa", "provision", "relief", "unexpected", "problem", "goals", "rizq", "way out", "stuck", "trapped"],
    "context": "Allah's promise that God-consciousness (taqwa) leads to unexpected solutions and provision. For someone feeling stuck, trapped, or unable to find a way out of their situation."
  },
  {
    "arabic": "وَمَن يَتَوَكَّلْ عَلَى اللَّهِ فَهُوَ حَسْبُهُ",
    "english": "And whoever relies upon Allah—then He is sufficient for him.",
    "reference": "65:3",
    "surah": "At-Talaq",
    "tags": ["reliance", "trust", "tawakkul", "sufficiency", "worry", "anxiety"],
    "context": "Promise that Allah suffices whoever truly relies on Him. For overcoming worry, anxiety, and learning to trust in Allah's plan."
  },
  {
    "arabic": "وَنُنَزِّلُ مِنَ الْقُرْآنِ مَا هُوَ شِفَاءٌ وَرَحْمَةٌ لِّلْمُؤْمِنِينَ",
    "english": "And We send down of the Quran that which is healing and mercy for the believers.",
    "reference": "17:82",
    "surah": "Al-Isra",
    "tags": ["healing", "mercy", "quran", "health", "problem", "sickness", "cure", "shifa"],
    "context": "The Quran as a source of healing—both spiritual and physical. For someone sick, in emotional pain, or seeking cure through the Quran."
  },
  {
    "arabic": "أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ",
    "english": "Unquestionably, by the remembrance of Allah hearts are assured.",
    "reference": "13:28",
    "surah": "Ar-Ra'd",
    "tags": ["remembrance", "peace", "heart", "anxiety", "tranquility", "calm", "dhikr", "stress"],
    "context": "Allah's declaration that true peace of heart comes only through His remembrance. For someone experiencing anxiety, restlessness, stress, or seeking inner peace and calm."
  },
  {
    "arabic": "رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ إِنَّ عَذَابَهَا كَانَ غَرَامًا",
    "english": "Our Lord, avert from us the punishment of Hell. Indeed, its punishment is ever adhering.",
    "reference": "25:65",
    "surah": "Al-Furqan",
    "tags": ["protection", "hell", "punishment", "hereafter", "fear"],
    "context": "Du'a of the servants of the Most Merciful seeking protection from Hellfire. For someone mindful of the hereafter and seeking safety from punishment."
  },
  {
    "arabic": "رَبِّ لَا تَذَرْنِي فَرْدًا وَأَنتَ خَيْرُ الْوَارِثِينَ",
    "english": "My Lord, do not leave me alone, and You are the best of inheritors.",
    "reference": "21:89",
    "surah": "Al-Anbiya",
    "tags": ["loneliness", "children", "family", "companionship", "problem", "marriage", "single", "isolation"],
    "context": "Du'a of Prophet Zakariyya when he felt alone and without an heir. For someone feeling lonely, wanting a spouse, wanting children, or struggling with isolation."
  },
  {
    "arabic": "رَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَىٰ رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ",
    "english": "Our Lord, and grant us what You promised us through Your messengers and do not disgrace us on the Day of Resurrection. Indeed, You do not fail in Your promise.",
    "reference": "3:194",
    "surah": "Aal-Imran",
    "tags": ["promise", "hereafter", "resurrection", "honor", "hope"],
    "context": "Du'a asking Allah to fulfill His promises and protect from disgrace on Judgment Day. For someone who trusts in Allah's promises and hopes for honor in the hereafter."
  },
  {
    "arabic": "رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنتَ مَوْلَانَا",
    "english": "Our Lord, and burden us not with that which we have no ability to bear. Pardon us, forgive us, and have mercy upon us. You are our protector.",
    "reference": "2:286",
    "surah": "Al-Baqarah",
    "tags": ["burden", "forgiveness", "mercy", "protection", "patience", "problem", "overwhelmed", "hardship", "strength"],
    "context": "Du'a when feeling overwhelmed by life's burdens. Asking Allah not to test beyond one's capacity and for pardon, forgiveness, and mercy. For someone at their breaking point or feeling they can't take anymore."
  }
]
